'''3. Напишите программу, в которой пользователь
будет задавать две строки, а программа - определять
количество вхождений одной строки в другой.'''

stroka1 = input('Введите 1-ую строку: ')
stroka2 = input('Введите 2-ую строку: ')
print(stroka2.count(stroka1))